In [2]:
import pandas as pd

In [4]:
info = {
    "Name" : ["Harshit","Manoj","Arif"],
    "CGPA" : [9.2,8.6,9.9]
}

df = pd.DataFrame(info)
print(df)

      Name  CGPA
0  Harshit   9.2
1    Manoj   8.6
2     Arif   9.9

In [5]:
df

      Name  CGPA
0  Harshit   9.2
1    Manoj   8.6
2     Arif   9.9

In [7]:
s = pd.Series([10,20,30,40,50])
print(s)
print(type(s))

0    10
1    20
2    30
3    40
4    50
dtype: int64
<class 'pandas.core.series.Series'>

In [8]:
# indexing
print(s[0])
print(s[1])

10
20

In [13]:
s = pd.Series([23,43,53,26,36],index=["Adam","Eve","Bob","Charlie","Nova"])
print(s)

Adam       23
Eve        43
Bob        53
Charlie    26
Nova       36
dtype: int64

In [14]:
print(s["Adam"])
print(s["Charlie"])

23
26

In [16]:
print(s.iloc[0])

23

In [17]:
s1 = pd.Series([1,2,3,4])
s2 = pd.Series([10,20,30,40])

print(s1+s2)

0    11
1    22
2    33
3    44
dtype: int64

In [23]:
# DATA-FRAME
info = {
    "Name":["adam","eve","bob"],
    "Age":[23,24,25],
    "GPA":[9.5,8.6,7.2]
}

df = pd.DataFrame(info)
print(df,type(df))
print(df.index)

   Name  Age  GPA
0  adam   23  9.5
1   eve   24  8.6
2   bob   25  7.2 <class 'pandas.core.frame.DataFrame'>
RangeIndex(start=0, stop=3, step=1)

In [21]:
df

   Name  Age  GPA
0  adam   23  9.5
1   eve   24  8.6
2   bob   25  7.2

In [28]:
df = pd.DataFrame([["Adam",44],["Eve",34],["Bob",24]],columns=["Name","Age"])
print(df)

   Name  Age
0  Adam   44
1   Eve   34
2   Bob   24

In [31]:
import numpy as np

arr = np.array([[1,2,3],[4,5,6]])

df = pd.DataFrame(arr, columns=["A","B","C"])

df

   A  B  C
0  1  2  3
1  4  5  6

In [33]:
df = pd.read_csv("employee_data.csv")
print(df)
print(type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000
<class 'pandas.core.frame.DataFrame'>

In [34]:
df = pd.read_json("employee_data.json")
print(df)
print(type(df))

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000
<class 'pandas.core.frame.DataFrame'>

In [35]:
df

   ID     Name  Age Department  Salary
0   1    Alice   25         HR   55000
1   2      Bob   32         IT   72000
2   3  Charlie   28    Finance   48000
3   4    David   45  Marketing   91000
4   5      Eva   38         IT   65000
5   6    Frank   29    Finance   50000
6   7    Grace   41         HR   82000
7   8   Hannah   26  Marketing   47000
8   9      Ian   35         IT   75000
9  10    Julia   30    Finance   60000

In [50]:
# head method -> give first five values
# tail mehtod -> give last five values
# sample method -> it give different values among the all the row
# info -> summary of data , type , num_of_rows, num_of_columns
# shpae -> tuple of rows and columns
# descrive -> describe about the data (min,max,mean,mode,median,25%,50%,75%)
# df.head()
# df.tail()
# df.sample() 
# df.info()
# df.describe()
# df.columns
df.nunique()

AttributeError: 'DataFrame' object has no attribute 'unique'